## Initial setup

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [8]:
#load csv files into pandas dataframe
freezer_data = pd.read_csv("E:\DSE\DataStorm 4.0\Semifinal\Data Storn - Semi final data sets\\freezer_data.csv")
outlets_data = pd.read_csv("E:\DSE\DataStorm 4.0\Semifinal\Data Storn - Semi final data sets\outlets_data.csv")
product_data = pd.read_csv("E:\DSE\DataStorm 4.0\Semifinal\Data Storn - Semi final data sets\product_data.csv")
sales_data = pd.read_csv("E:\DSE\DataStorm 4.0\Semifinal\Data Storn - Semi final data sets\sales_data.csv")
week_data = pd.read_csv("E:\DSE\DataStorm 4.0\Semifinal\Data Storn - Semi final data sets\week_data.csv")

In [15]:
freezer_data.head()

,Freezer Name,Model Number,Volume Capacity (Liters),Power and maitainance Cost (LKR) per 100 hours
0,ChillMaster,M001,55,2500
1,FreezeZone,M002,75,2800
2,CoolTech,M003,120,3200
3,mini CoolTech,M004,30,1800
4,IceBlast Pro,M005,150,3500

In [16]:
freezer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Freezer Name                                    10 non-null     object
 1   Model Number                                    10 non-null     object
 2   Volume Capacity (Liters)                        10 non-null     int64
 3   Power and maitainance Cost (LKR) per 100 hours  10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [11]:
outlets_data.head()

  Outlet_ID  area(sqft)
0    ID7203        5660
1    ID1878        4138
2    ID1740        5546
3    ID4366        5134
4    ID8358        4100

In [17]:
outlets_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 988 entries, 0 to 987
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Outlet_ID   988 non-null    object
 1   area(sqft)  988 non-null    int64
dtypes: int64(1), object(1)
memory usage: 15.6+ KB

In [12]:
product_data.head()

   pid  volume              product_name  price
0  IP1     0.2         Vanilla Mini Cone    100
1  IP2     0.2      Chocolate Petite Bar     90
2  IP3     0.2       Strawberry Tiny Cup    110
3  IP4     0.2        Mint Bite-size Pop    100
4  IP5     0.2  Butter Pecan Small Stick    100

In [18]:
product_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pid           10 non-null     object
 1   volume        10 non-null     float64
 2   product_name  10 non-null     object
 3   price         10 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [13]:
sales_data.head()

  Outlet_ID  week  pid              product_name  no_units
0    ID7203     1  IP1         Vanilla Mini Cone     874.0
1    ID7203     1  IP2      Chocolate Petite Bar     105.0
2    ID7203     1  IP3       Strawberry Tiny Cup    1198.0
3    ID7203     1  IP4        Mint Bite-size Pop     502.0
4    ID7203     1  IP5  Butter Pecan Small Stick     710.0

In [20]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81000 entries, 0 to 80999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Outlet_ID     81000 non-null  object
 1   week          81000 non-null  int64
 2   pid           81000 non-null  object
 3   product_name  81000 non-null  object
 4   no_units      81000 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB

In [14]:
week_data.head()

     Week Start Date   End Date
0  Week 1   1/2/2023   1/8/2023
1  Week 2   1/9/2023  1/15/2023
2  Week 3  1/16/2023  1/22/2023
3  Week 4  1/23/2023  1/29/2023
4  Week 5  1/30/2023   2/5/2023

In [21]:
week_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Week        12 non-null     object
 1   Start Date  12 non-null     object
 2   End Date    12 non-null     object
dtypes: object(3)
memory usage: 416.0+ bytes